src/main/resources/TestWriteThroughtOld/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1847964,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5935397009899395,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2995.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1943.6785042639754,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Java Request" : {
    "transaction" : "Java Request",
    "sampleCount" : 1847964,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5935397009899395,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2995.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1943.6785042639754,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}